"""
Даны значения величины заработной платы заемщиков банка (zp) и значения их
поведенческого кредитного скоринга (ks):
zp = [35, 45, 190, 200, 40, 70, 54, 150, 120, 110],
ks = [401, 574, 874, 919, 459, 739, 653, 902, 746, 832].
Найдите ковариацию этих двух величин с помощью элементарных действий, а затем с
помощью функции cov из numpy. Полученные значения должны быть равны.
Найдите коэффициент корреляции Пирсона с помощью ковариации и
среднеквадратичных отклонений двух признаков, а затем с использованием функций из библиотек numpy и pandas
"""
import numpy
import pandas

zp = numpy.array([35, 45, 190, 200, 40, 70, 54, 150, 120, 110])
ks = numpy.array([401, 574, 874, 919, 459, 739, 653, 902, 746, 832])
cov = round(numpy.mean(zp * ks) - numpy.mean(zp) * numpy.mean(ks), 2)  # 9157.84
cov_numpy = numpy.cov(zp, ks, ddof=0)[0][1]  # 9157.84
pirson = cov / (numpy.std(zp, ddof=0) * numpy.std(ks, ddof=0))  # 0.8874900920739162
pirson_numpy = numpy.corrcoef(zp, ks)[0][1]  # 0.8874900920739162
zp_1 = pandas.Series([35, 45, 190, 200, 40, 70, 54, 150, 120, 110])
ks_1 = pandas.Series([401, 574, 874, 919, 459, 739, 653, 902, 746, 832])
zp_1.corr(ks_1, method='pearson')  # 0.8874900920739162
