"""
Измерены значения IQ выборки студентов,
обучающихся в местных технических вузах:
131, 125, 115, 122, 131, 115, 107, 99, 125, 111.
Известно, что в генеральной совокупности IQ распределен нормально.
Найдите доверительный интервал для математического ожидания с надежностью 0.95.
"""
import numpy
from scipy import stats

x = [131, 125, 115, 122, 131, 115, 107, 99, 125, 111]
alfa = 0.05
# Так как мы знаем дисперсию генеральной совокупности, то используем t критерий Стьюденса
t = stats.t.ppf(1 - alfa / 2, df=len(x) - 1)  # 2.2621571627409915
M_x = numpy.mean(x)  # 118.1
sigma_x = numpy.std(x)  # 10.004498987955369
x_1 = M_x - t * sigma_x / numpy.sqrt(len(x))  # 110.9432125583706
x_2 = M_x + t * sigma_x / numpy.sqrt(len(x))  # 125.25678744162938
# С вероятностью 95% интервал [110.94; 125.26] захватит истинное математическое ожидание
