"""
Известно, что рост футболистов в сборной распределен нормально
с дисперсией генеральной совокупности, равной 25 кв.см. Объем выборки равен 27,
среднее выборочное составляет 174.2. Найдите доверительный интервал для
математического ожидания с надежностью 0.95.
"""
import numpy
from scipy import stats

D = 25
n = 27
M = 174.2
alfa = 0.05
# Так как мы знаем дисперсию генеральной совокупности, то используем z критерий
z = stats.norm.ppf(1 - alfa / 2)  # 1.959963984540054
x_1 = M - (z * numpy.sqrt(D)) / numpy.sqrt(n)  # 172.3140237765397
x_2 = M + (z * numpy.sqrt(D)) / numpy.sqrt(n)  # 176.08597622346028
print(x_1, x_2)
# С вероятностью 95% интервал [172.31; 176.09] захватит истинное математическое ожидание
