"""
Даны значения величины заработной платы заемщиков банка (zp) и значения их
поведенческого кредитного скоринга (ks): zp = [35, 45, 190, 200, 40, 70, 54, 150, 120, 110],
ks = [401, 574, 874, 919, 459, 739, 653, 902, 746, 832]. Используя математические
операции, посчитать коэффициенты линейной регрессии, приняв за X заработную плату
(то есть, zp - признак), а за y - значения скорингового балла (то есть, ks - целевая
переменная). Произвести расчет как с использованием intercept, так и без.
"""
import numpy

# c intercept
zp = numpy.array([35, 45, 190, 200, 40, 70, 54, 150, 120, 110])  # x
ks = numpy.array([401, 574, 874, 919, 459, 739, 653, 902, 746, 832])  # y
n = len(zp)
b = (n * numpy.sum(zp * ks) - numpy.sum(zp) * numpy.sum(ks)) / (n * numpy.sum(zp ** 2) - numpy.sum(zp) ** 2)
a = numpy.mean(ks) - numpy.mean(zp) * b
print(a, b)  # 444.17735732435955 2.6205388824027653
#  без intersept
x = zp.reshape((n, 1))
y = ks.reshape((n, 1))
B = numpy.dot(numpy.linalg.inv(numpy.dot(x.T, x)), x.T @ y)
print(B)  # 5.88982042
