"""
1е измерение до приема препарата: 150, 160, 165, 145, 155
2е измерение через 10 минут: 140, 155, 150, 130, 135
Сравните 1 и 2 е измерения, предполагая, что 3го измерения через 30 минут не было. Есть
ли статистически значимые различия между измерениями давления?
"""
from scipy import stats

before = [150, 160, 165, 145, 155]
after = [140, 155, 150, 130, 135]
# Так как выборок две и они зависимые, то применяем критерий Уилкоксона
stats.wilcoxon(before, after)  # WilcoxonResult(statistic=0.0, pvalue=0.0625)
# pvalue > 0.05, значит нулевую гипотезу не отвергаем
# делаем вывод, что со статистическим уровнем значимости 0.05 препарат не работает
