"""
Даны две независимые выборки. Не соблюдается условие нормальности
x1 380,420, 290
y1 140,360,200,900
Сделайте вывод по результатам, полученным с помощью функции,
имеются ли статистические различия между группами?
"""

from scipy import stats

x = [380, 420, 290]
y = [140, 360, 200, 900]
# так как выборки две и они независимые, то используем критерий Манна-Уитни
stats.mannwhitneyu(x, y)  # statistic=8.0, pvalue=0.6285714285714286
# pvalue получилось больше 0.05, значит нулевая гиполеза не отвергается
# Делаем вывод, что статистических различий в выборках нет
