"""
Даны 3 группы учеников плавания. Не соблюдается условие нормальности.
В 1 группе время на дистанцию 50 м составляют: 56, 60, 62, 55, 71, 67, 59, 58, 64, 67
Вторая группа : 57, 58, 69, 48, 72, 70, 68, 71, 50, 53
Третья группа: 57, 67, 49, 48, 47, 55, 66, 51, 54
Есть ли статистически значимые различия между группами?
"""
from scipy import stats

x_1 = [56, 60, 62, 55, 71, 67, 59, 58, 64, 67]
x_2 = [57, 58, 69, 48, 72, 70, 68, 71, 50, 53]
x_3 = [57, 67, 49, 48, 47, 55, 66, 51, 54]
# Выборки независимы и их больше двух, значит используем критерий Крускала-Уоллиса
print(stats.kruskal(x_1, x_2, x_3))  # statistic=5.465564058257224, pvalue=0.06503809985904942
# pvalue > 0.05, значит нулевую гипотезу не отвергаем
# Делаем вывод, что статитстически значимых различий между группами нет на уровне статистической занчисмости 0.05
# Все плавают одинаково
