"""
Заявляется, что партия изготавливается со средним арифметическим 2,5 см. Проверить
данную гипотезу, если известно, что размеры изделий подчинены нормальному закону
распределения. Объем выборки 10, уровень статистической значимости 5%
2.51, 2.35, 2.74, 2.56, 2.40, 2.36, 2.65, 2.7, 2.67, 2.34
"""
import numpy
from scipy import stats

n = 10
M_0 = 2.5
x = [2.51, 2.35, 2.74, 2.56, 2.40, 2.36, 2.65, 2.7, 2.67, 2.34]
alfa = 0.05
# Мы не знаем СКО генеральной совокупности, значит используем критерий Стьюдента
t_1 = stats.t.ppf(alfa / 2, df=(n - 1))  # -2.262157162740992
t_2 = stats.t.ppf(1 - (alfa / 2), df=(n - 1))  # 2.2621571627409915
print(t_1, t_2)
M_x = numpy.mean(x)  # 2.5279999999999996
sd = numpy.std(x, ddof=1)  # 0.1572542173961923
print(sd)
t_x = (M_x - M_0) / (sd / numpy.sqrt(n))  # 0.5630613661802959
print(t_x)
# Наблюдаемое t меньше t критического, значит нулевую гипотезу не отвергаем.
# Делаем вывод,что на уровне значимости 0.05 партия изготавливается со средним арифметическим 2,5 см
