"""
Есть ли статистически значимые различия в среднем росте матерей и дочерей?
Рост матерей 172, 177, 158, 170, 178,175, 164, 160, 169, 165
Рост взрослых дочерей: 173, 175, 162, 174, 175, 168, 155, 170, 160, 163
"""
from scipy import stats

x = [172, 177, 158, 170, 178, 175, 164, 160, 169, 165]
y = [173, 175, 162, 174, 175, 168, 155, 170, 160, 163]
# нулевая гипотеза - средние равны
# H1 - средние не равны
alfa = 0.05
stats.ttest_rel(x, y)  # statistic=0.6648478531431979, pvalue=0.5228168632983574
# Полученное p-value  больше, чем заданое альфа, то мы не отвергаем нулевую гипотезу
# Делаем вывод, что нет статистических различий между ростом матерей и дочерей
