"""
Устройство состоит из трех деталей.
Для первой детали вероятность выйти из строя в первый месяц равна 0.1,
для второй - 0.2, для третьей - 0.25.
Какова вероятность того, что в первый месяц выйдут из строя:
а). все детали б). только две детали в). хотя бы одна деталь г). от одной до двух деталей?
"""

# выйдут из строя все детали
P_all = ((1 / 3) * 0.1) + ((1 / 3) * 0.2) + ((1 / 3) * 0.25)
# только две детали
P_2 = ((1 / 3) * 0.1) * ((1 / 3) * 0.2) + ((1 / 3) * 0.1) * ((1 / 3) * 0.25) + \
      ((1 / 3) * 0.25) * ((1 / 3) * 0.2)
# хотя бы одна деталь
P_0 = ((1 / 3) * 0.9) + ((1 / 3) * 0.8) + ((1 / 3) * 0.75)
P_1_or_more = 1 - P_0
# от одной до двух деталей
P_1 = ((1 / 3) * 0.1) + ((1 / 3) * 0.2) + ((1 / 3) * 0.25)
P_1_or_2 = P_1 + P_2
print(P_all, P_2, P_1_or_more, P_1_or_2)
