"""
На соревновании по биатлону один из трех спортсменов стреляет и попадает в мишень.
Вероятность попадания для первого спортсмена равна 0.9, для второго — 0.8, для третьего — 0.6.
Найти вероятность того, что выстрел произведен:
a). первым спортсменом б). вторым спортсменом в). третьим спортсменом.
"""
# вероятность попадания
P_A = (1 / 3) * 0.9 + (1 / 3) * 0.8 + (1 / 3) * 0.6
# вероятность, что попал первый спортсмен
P_B_1 = ((1 / 3) * 0.9) / P_A
# вероятность, что попал второй спортсмен
P_B_2 = ((1 / 3) * 0.8) / P_A
# вероятность, что попал третий спортсмен
P_B_3 = ((1 / 3) * 0.6) / P_A
print(P_B_1, P_B_2, P_B_3)
