"""
 В университет на факультеты A и B поступило равное количество студентов,
 а на факультет C студентов поступило столько же, сколько на A и B вместе.
 Вероятность того, что студент факультета A сдаст первую сессию, равна 0.8.
 Для студента факультета B эта вероятность равна 0.7, а для студента факультета C - 0.9.
 Студент сдал первую сессию. Какова вероятность, что он учится:
 a). на факультете A б). на факультете B в). на факультете C?
"""

# вероятность сдачи экзамена
P_A = (1 / 4) * 0.8 + (1 / 4) * 0.7 + (1 / 2) * 0.9
# вероятность, что сдал студент с факультета А
P_B_1 = ((1 / 4) * 0.8) / P_A
# вероятность, что сдал студент с факультета В
P_B_2 = ((1 / 4) * 0.7) / P_A
# вероятность, что сдал студент с факультета С
P_B_3 = ((1 / 2) * 0.9) / P_A
print(P_B_1, P_B_2, P_B_3)
