"""
Случайная непрерывная величина A имеет равномерное распределение на промежутке (200, 800].
Найдите ее среднее значение и дисперсию
"""

a = 200
b = 800
M = (a + b) / 2
D = ((b - a) ** 2) / 12
print(M, D)
