"""
Задача 3. Рост дочерей 175, 167, 154, 174, 178, 148, 160, 167, 169, 170
Рост матерей 178, 165, 165, 173, 168, 155, 160, 164, 178, 175
Используя эти данные построить 95% доверительный интервал для разности среднего
роста родителей и детей.
"""
import numpy
from scipy import stats

x = [175, 167, 154, 174, 178, 148, 160, 167, 169, 170]
y = [178, 165, 165, 173, 168, 155, 160, 164, 178, 175]
alfa = 0.05
n_x = len(x)
n_y = len(y)
n = 10
mean_x = numpy.mean(x)
mean_y = numpy.mean(y)
D_x = numpy.var(x, ddof=1)
D_y = numpy.var(y, ddof=1)
delta = mean_y - mean_x
D = (D_x + D_y) / 2
se = numpy.sqrt(D / n_x + D / n_y)
t = stats.t.ppf(alfa / 2, df=2 * (n - 1))  # -2.10092204024096
left_border = delta + t * se  # -6.268418034506846
right_border = delta - t * se  # 10.068418034506857
# разность среднего роста родителей и детей лежит в интервале [-6.27; 10.07]  с вероятностью 95%
